codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0064gpl036.h
extern volatile __CCP2TMRbits_t CCP2TMRbits __asm__ ("CCP2TMR") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2TMRCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2TMRSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2TMRINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2PR __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned PRL:16;
    unsigned PRH:16;
  };
  struct {
    unsigned PR:32;
  };
} __CCP2PRbits_t;
extern volatile __CCP2PRbits_t CCP2PRbits __asm__ ("CCP2PR") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2PRCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2PRSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2PRINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2RA __attribute__((section("sfrs")));
typedef struct {
  unsigned CMPA:16;
} __CCP2RAbits_t;
extern volatile __CCP2RAbits_t CCP2RAbits __asm__ ("CCP2RA") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2RACLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2RASET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2RAINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2RB __attribute__((section("sfrs")));
typedef struct {
  unsigned CMPB:16;
} __CCP2RBbits_t;
extern volatile __CCP2RBbits_t CCP2RBbits __asm__ ("CCP2RB") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2RBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2RBSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2RBINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2BUF __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned BUFL:16;
    unsigned BUFH:16;
  };
  struct {
    unsigned BUF:32;
  };
} __CCP2BUFbits_t;
extern volatile __CCP2BUFbits_t CCP2BUFbits __asm__ ("CCP2BUF") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2BUFCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2BUFSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2BUFINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3CON1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned MOD:4;
    unsigned CCSEL:1;
    unsigned T32:1;
    unsigned TMRPS:2;
    unsigned CLKSEL:3;
    unsigned TMRSYNC:1;
    unsigned CCPSLP:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned SYNC:5;
    unsigned ALTSYNC:1;
    unsigned ONESHOT:1;
    unsigned TRIGEN:1;
    unsigned OPS:4;
    unsigned :2;
    unsigned RTRGEN:1;
    unsigned OPSSRC:1;
  };
  struct {
    unsigned w:32;
  };
} __CCP3CON1bits_t;
extern volatile __CCP3CON1bits_t CCP3CON1bits __asm__ ("CCP3CON1") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3CON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3CON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3CON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3CON2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ASDG:8;
    unsigned :4;
    unsigned SSDG:1;
    unsigned :1;
    unsigned ASDGM:1;
    unsigned PWMRSEN:1;
    unsigned ICS:3;
    unsigned AUXOUT:2;
    unsigned :1;
    unsigned ICGSM:2;
    unsigned OCAEN:1;
    unsigned :6;
    unsigned OENSYNC:1;
  };
  struct {
    unsigned w:32;
  };
} __CCP3CON2bits_t;
extern volatile __CCP3CON2bits_t CCP3CON2bits __asm__ ("CCP3CON2") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3CON2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3CON2SET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3CON2INV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3CON3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :18;
    unsigned PSSACE:2;
    unsigned :1;
    unsigned POLACE:1;
    unsigned :6;
    unsigned OSCNT:3;
    unsigned OETRIG:1;
  };
  struct {
    unsigned w:32;
  };
} __CCP3CON3bits_t;
extern volatile __CCP3CON3bits_t CCP3CON3bits __asm__ ("CCP3CON3") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3CON3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3CON3SET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3CON3INV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3STAT __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICDIS:1;
    unsigned SCEVT:1;
    unsigned ASEVT:1;
    unsigned TRCLR:1;
    unsigned TRSET:1;
    unsigned CCPTRIG:1;
    unsigned :2;
    unsigned ICGARM:1;
    unsigned :5;
    unsigned RAWIP:1;
    unsigned RBWIP:1;
    unsigned TMRLWIP:1;
    unsigned TMRHWIP:1;
    unsigned PRLWIP:1;
  };
  struct {
    unsigned w:32;
  };
} __CCP3STATbits_t;
extern volatile __CCP3STATbits_t CCP3STATbits __asm__ ("CCP3STAT") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3STATCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3STATSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3STATINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3TMR __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TMRL:16;
    unsigned TMRH:16;
  };
  struct {
    unsigned TMR:32;
  };
} __CCP3TMRbits_t;
extern volatile __CCP3TMRbits_t CCP3TMRbits __asm__ ("CCP3TMR") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3TMRCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3TMRSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3TMRINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3PR __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned PRL:16;
    unsigned PRH:16;
  };
  struct {
    unsigned PR:32;
  };
} __CCP3PRbits_t;
extern volatile __CCP3PRbits_t CCP3PRbits __asm__ ("CCP3PR") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3PRCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3PRSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3PRINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3RA __attribute__((section("sfrs")));
typedef struct {
  unsigned CMPA:16;
} __CCP3RAbits_t;
extern volatile __CCP3RAbits_t CCP3RAbits __asm__ ("CCP3RA") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3RACLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3RASET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3RAINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3RB __attribute__((section("sfrs")));
typedef struct {
  unsigned CMPB:16;
} __CCP3RBbits_t;
extern volatile __CCP3RBbits_t CCP3RBbits __asm__ ("CCP3RB") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3RBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3RBSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3RBINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3BUF __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned BUFL:16;
    unsigned BUFH:16;
  };
  struct {
    unsigned BUF:32;
  };
} __CCP3BUFbits_t;
extern volatile __CCP3BUFbits_t CCP3BUFbits __asm__ ("CCP3BUF") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3BUFCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3BUFSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP3BUFINV __attribute__((section("sfrs")));
extern volatile unsigned int        I2C1CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned SEN:1;
    unsigned RSEN:1;
    unsigned PEN:1;
    unsigned RCEN:1;
    unsigned ACKEN:1;
    unsigned ACKDT:1;
    unsigned STREN:1;
    unsigned GCEN:1;
    unsigned SMEN:1;
    unsigned DISSLW:1;
    unsigned A10M:1;
    unsigned STRICT:1;
    unsigned SCLREL:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned DHEN:1;
    unsigned AHEN:1;
    unsigned SBCDE:1;
    unsigned SDAHT:1;
    unsigned BOEN:1;
    unsigned SCIE:1;
    unsigned PCIE:1;
  };
  struct {
    unsigned :11;
    unsigned IPMIEN:1;
    unsigned :1;
    unsigned I2CSIDL:1;
    unsigned :1;
    unsigned I2CEN:1;
  };
} __I2C1CONbits_t;
