codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0064gpl036.h
  .extern RPINR3SET        /* 0xBF8024C8 */
  .extern RPINR3INV        /* 0xBF8024CC */
  .extern RPINR5           /* 0xBF8024E0 */
  .extern RPINR5CLR        /* 0xBF8024E4 */
  .extern RPINR5SET        /* 0xBF8024E8 */
  .extern RPINR5INV        /* 0xBF8024EC */
  .extern RPINR6           /* 0xBF8024F0 */
  .extern RPINR6CLR        /* 0xBF8024F4 */
  .extern RPINR6SET        /* 0xBF8024F8 */
  .extern RPINR6INV        /* 0xBF8024FC */
  .extern RPINR9           /* 0xBF802520 */
  .extern RPINR9CLR        /* 0xBF802524 */
  .extern RPINR9SET        /* 0xBF802528 */
  .extern RPINR9INV        /* 0xBF80252C */
  .extern RPINR11          /* 0xBF802540 */
  .extern RPINR11CLR       /* 0xBF802544 */
  .extern RPINR11SET       /* 0xBF802548 */
  .extern RPINR11INV       /* 0xBF80254C */
  .extern RPINR12          /* 0xBF802550 */
  .extern RPINR12CLR       /* 0xBF802554 */
  .extern RPINR12SET       /* 0xBF802558 */
  .extern RPINR12INV       /* 0xBF80255C */
  .extern RPOR0            /* 0xBF802590 */
  .extern RPOR0CLR         /* 0xBF802594 */
  .extern RPOR0SET         /* 0xBF802598 */
  .extern RPOR0INV         /* 0xBF80259C */
  .extern RPOR1            /* 0xBF8025A0 */
  .extern RPOR1CLR         /* 0xBF8025A4 */
  .extern RPOR1SET         /* 0xBF8025A8 */
  .extern RPOR1INV         /* 0xBF8025AC */
  .extern RPOR2            /* 0xBF8025B0 */
  .extern RPOR2CLR         /* 0xBF8025B4 */
  .extern RPOR2SET         /* 0xBF8025B8 */
  .extern RPOR2INV         /* 0xBF8025BC */
  .extern RPOR3            /* 0xBF8025C0 */
  .extern RPOR3CLR         /* 0xBF8025C4 */
  .extern RPOR3SET         /* 0xBF8025C8 */
  .extern RPOR3INV         /* 0xBF8025CC */
  .extern RPOR4            /* 0xBF8025D0 */
  .extern RPOR4CLR         /* 0xBF8025D4 */
  .extern RPOR4SET         /* 0xBF8025D8 */
  .extern RPOR4INV         /* 0xBF8025DC */
  .extern ANSELA           /* 0xBF802600 */
  .extern ANSELACLR        /* 0xBF802604 */
  .extern ANSELASET        /* 0xBF802608 */
  .extern ANSELAINV        /* 0xBF80260C */
  .extern TRISA            /* 0xBF802610 */
  .extern TRISACLR         /* 0xBF802614 */
  .extern TRISASET         /* 0xBF802618 */
  .extern TRISAINV         /* 0xBF80261C */
  .extern PORTA            /* 0xBF802620 */
  .extern PORTACLR         /* 0xBF802624 */
  .extern PORTASET         /* 0xBF802628 */
  .extern PORTAINV         /* 0xBF80262C */
  .extern LATA             /* 0xBF802630 */
  .extern LATACLR          /* 0xBF802634 */
  .extern LATASET          /* 0xBF802638 */
  .extern LATAINV          /* 0xBF80263C */
  .extern ODCA             /* 0xBF802640 */
  .extern ODCACLR          /* 0xBF802644 */
  .extern ODCASET          /* 0xBF802648 */
  .extern ODCAINV          /* 0xBF80264C */
  .extern CNPUA            /* 0xBF802650 */
  .extern CNPUACLR         /* 0xBF802654 */
  .extern CNPUASET         /* 0xBF802658 */
  .extern CNPUAINV         /* 0xBF80265C */
  .extern CNPDA            /* 0xBF802660 */
  .extern CNPDACLR         /* 0xBF802664 */
  .extern CNPDASET         /* 0xBF802668 */
  .extern CNPDAINV         /* 0xBF80266C */
  .extern CNCONA           /* 0xBF802670 */
  .extern CNCONACLR        /* 0xBF802674 */
  .extern CNCONASET        /* 0xBF802678 */
  .extern CNCONAINV        /* 0xBF80267C */
  .extern CNEN0A           /* 0xBF802680 */
  .extern CNEN0ACLR        /* 0xBF802684 */
  .extern CNEN0ASET        /* 0xBF802688 */
  .extern CNEN0AINV        /* 0xBF80268C */
  .extern CNSTATA          /* 0xBF802690 */
  .extern CNSTATACLR       /* 0xBF802694 */
  .extern CNSTATASET       /* 0xBF802698 */
  .extern CNSTATAINV       /* 0xBF80269C */
  .extern CNEN1A           /* 0xBF8026A0 */
  .extern CNEN1ACLR        /* 0xBF8026A4 */
  .extern CNEN1ASET        /* 0xBF8026A8 */
  .extern CNEN1AINV        /* 0xBF8026AC */
  .extern CNFA             /* 0xBF8026B0 */
  .extern CNFACLR          /* 0xBF8026B4 */
  .extern CNFASET          /* 0xBF8026B8 */
  .extern CNFAINV          /* 0xBF8026BC */
  .extern SR0A             /* 0xBF8026C0 */
  .extern SR0ACLR          /* 0xBF8026C4 */
  .extern SR0ASET          /* 0xBF8026C8 */
  .extern SR0AINV          /* 0xBF8026CC */
  .extern SR1A             /* 0xBF8026D0 */
  .extern SR1ACLR          /* 0xBF8026D4 */
  .extern SR1ASET          /* 0xBF8026D8 */
  .extern SR1AINV          /* 0xBF8026DC */
  .extern ANSELB           /* 0xBF802700 */
  .extern ANSELBCLR        /* 0xBF802704 */
  .extern ANSELBSET        /* 0xBF802708 */
  .extern ANSELBINV        /* 0xBF80270C */
  .extern TRISB            /* 0xBF802710 */
  .extern TRISBCLR         /* 0xBF802714 */
  .extern TRISBSET         /* 0xBF802718 */
  .extern TRISBINV         /* 0xBF80271C */
  .extern PORTB            /* 0xBF802720 */
  .extern PORTBCLR         /* 0xBF802724 */
  .extern PORTBSET         /* 0xBF802728 */
  .extern PORTBINV         /* 0xBF80272C */
  .extern LATB             /* 0xBF802730 */
  .extern LATBCLR          /* 0xBF802734 */
  .extern LATBSET          /* 0xBF802738 */
  .extern LATBINV          /* 0xBF80273C */
  .extern ODCB             /* 0xBF802740 */
  .extern ODCBCLR          /* 0xBF802744 */
  .extern ODCBSET          /* 0xBF802748 */
  .extern ODCBINV          /* 0xBF80274C */
  .extern CNPUB            /* 0xBF802750 */
  .extern CNPUBCLR         /* 0xBF802754 */
  .extern CNPUBSET         /* 0xBF802758 */
  .extern CNPUBINV         /* 0xBF80275C */
  .extern CNPDB            /* 0xBF802760 */
  .extern CNPDBCLR         /* 0xBF802764 */
  .extern CNPDBSET         /* 0xBF802768 */
  .extern CNPDBINV         /* 0xBF80276C */
  .extern CNCONB           /* 0xBF802770 */
  .extern CNCONBCLR        /* 0xBF802774 */
  .extern CNCONBSET        /* 0xBF802778 */
  .extern CNCONBINV        /* 0xBF80277C */
  .extern CNEN0B           /* 0xBF802780 */
  .extern CNEN0BCLR        /* 0xBF802784 */
  .extern CNEN0BSET        /* 0xBF802788 */
  .extern CNEN0BINV        /* 0xBF80278C */
  .extern CNSTATB          /* 0xBF802790 */
  .extern CNSTATBCLR       /* 0xBF802794 */
  .extern CNSTATBSET       /* 0xBF802798 */
  .extern CNSTATBINV       /* 0xBF80279C */
  .extern CNEN1B           /* 0xBF8027A0 */
  .extern CNEN1BCLR        /* 0xBF8027A4 */
  .extern CNEN1BSET        /* 0xBF8027A8 */
  .extern CNEN1BINV        /* 0xBF8027AC */
  .extern CNFB             /* 0xBF8027B0 */
  .extern CNFBCLR          /* 0xBF8027B4 */
  .extern CNFBSET          /* 0xBF8027B8 */
  .extern CNFBINV          /* 0xBF8027BC */
  .extern SR0B             /* 0xBF8027C0 */
  .extern SR0BCLR          /* 0xBF8027C4 */
  .extern SR0BSET          /* 0xBF8027C8 */
  .extern SR0BINV          /* 0xBF8027CC */
  .extern SR1B             /* 0xBF8027D0 */
  .extern SR1BCLR          /* 0xBF8027D4 */
  .extern SR1BSET          /* 0xBF8027D8 */
  .extern SR1BINV          /* 0xBF8027DC */
  .extern ANSELC           /* 0xBF802800 */
  .extern ANSELCCLR        /* 0xBF802804 */
  .extern ANSELCSET        /* 0xBF802808 */
  .extern ANSELCINV        /* 0xBF80280C */
  .extern TRISC            /* 0xBF802810 */
  .extern TRISCCLR         /* 0xBF802814 */
  .extern TRISCSET         /* 0xBF802818 */
  .extern TRISCINV         /* 0xBF80281C */
  .extern PORTC            /* 0xBF802820 */
  .extern PORTCCLR         /* 0xBF802824 */
  .extern PORTCSET         /* 0xBF802828 */
  .extern PORTCINV         /* 0xBF80282C */
  .extern LATC             /* 0xBF802830 */
  .extern LATCCLR          /* 0xBF802834 */
  .extern LATCSET          /* 0xBF802838 */
  .extern LATCINV          /* 0xBF80283C */
  .extern ODCC             /* 0xBF802840 */
  .extern ODCCCLR          /* 0xBF802844 */
  .extern ODCCSET          /* 0xBF802848 */
  .extern ODCCINV          /* 0xBF80284C */
  .extern CNPUC            /* 0xBF802850 */
  .extern CNPUCCLR         /* 0xBF802854 */
  .extern CNPUCSET         /* 0xBF802858 */
  .extern CNPUCINV         /* 0xBF80285C */
  .extern CNPDC            /* 0xBF802860 */
  .extern CNPDCCLR         /* 0xBF802864 */
  .extern CNPDCSET         /* 0xBF802868 */
  .extern CNPDCINV         /* 0xBF80286C */
  .extern CNCONC           /* 0xBF802870 */
  .extern CNCONCCLR        /* 0xBF802874 */
  .extern CNCONCSET        /* 0xBF802878 */
  .extern CNCONCINV        /* 0xBF80287C */
  .extern CNEN0C           /* 0xBF802880 */
  .extern CNEN0CCLR        /* 0xBF802884 */
  .extern CNEN0CSET        /* 0xBF802888 */
  .extern CNEN0CINV        /* 0xBF80288C */
  .extern CNSTATC          /* 0xBF802890 */
  .extern CNSTATCCLR       /* 0xBF802894 */
  .extern CNSTATCSET       /* 0xBF802898 */
  .extern CNSTATCINV       /* 0xBF80289C */
  .extern CNEN1C           /* 0xBF8028A0 */
  .extern CNEN1CCLR        /* 0xBF8028A4 */
  .extern CNEN1CSET        /* 0xBF8028A8 */
  .extern CNEN1CINV        /* 0xBF8028AC */
  .extern CNFC             /* 0xBF8028B0 */
  .extern CNFCCLR          /* 0xBF8028B4 */
  .extern CNFCSET          /* 0xBF8028B8 */
  .extern CNFCINV          /* 0xBF8028BC */
  .extern SR0C             /* 0xBF8028C0 */
  .extern SR0CCLR          /* 0xBF8028C4 */
  .extern SR0CSET          /* 0xBF8028C8 */
  .extern SR0CINV          /* 0xBF8028CC */
  .extern SR1C             /* 0xBF8028D0 */
  .extern SR1CCLR          /* 0xBF8028D4 */
  .extern SR1CSET          /* 0xBF8028D8 */
  .extern SR1CINV          /* 0xBF8028DC */
  .extern PMDCON           /* 0xBF802C00 */
  .extern PMDCONCLR        /* 0xBF802C04 */
  .extern PMDCONSET        /* 0xBF802C08 */
  .extern PMDCONINV        /* 0xBF802C0C */
  .extern PMD1             /* 0xBF802C10 */
  .extern PMD1CLR          /* 0xBF802C14 */
  .extern PMD1SET          /* 0xBF802C18 */
  .extern PMD1INV          /* 0xBF802C1C */
  .extern PMD2             /* 0xBF802C20 */
  .extern PMD2CLR          /* 0xBF802C24 */
  .extern PMD2SET          /* 0xBF802C28 */
  .extern PMD2INV          /* 0xBF802C2C */
  .extern PMD3             /* 0xBF802C30 */
  .extern PMD3CLR          /* 0xBF802C34 */
  .extern PMD3SET          /* 0xBF802C38 */
  .extern PMD3INV          /* 0xBF802C3C */
  .extern PMD4             /* 0xBF802C40 */
  .extern PMD4CLR          /* 0xBF802C44 */
  .extern PMD4SET          /* 0xBF802C48 */
  .extern PMD4INV          /* 0xBF802C4C */
  .extern PMD5             /* 0xBF802C50 */
  .extern PMD5CLR          /* 0xBF802C54 */
  .extern PMD5SET          /* 0xBF802C58 */
  .extern PMD5INV          /* 0xBF802C5C */
  .extern PMD6             /* 0xBF802C60 */
  .extern PMD6CLR          /* 0xBF802C64 */
  .extern PMD6SET          /* 0xBF802C68 */
  .extern PMD6INV          /* 0xBF802C6C */
  .extern PMD7             /* 0xBF802C70 */
  .extern PMD7CLR          /* 0xBF802C74 */
  .extern PMD7SET          /* 0xBF802C78 */
  .extern PMD7INV          /* 0xBF802C7C */
  .extern CFGCON           /* 0xBF803B00 */
  .extern CFGCONCLR        /* 0xBF803B04 */
  .extern CFGCONSET        /* 0xBF803B08 */
  .extern CFGCONINV        /* 0xBF803B0C */
  .extern DEVID            /* 0xBF803B20 */
  .extern DEVIDCLR         /* 0xBF803B24 */
  .extern DEVIDSET         /* 0xBF803B28 */
  .extern DEVIDINV         /* 0xBF803B2C */
  .extern SYSKEY           /* 0xBF803B30 */
  .extern SYSKEYCLR        /* 0xBF803B34 */
  .extern SYSKEYSET        /* 0xBF803B38 */
  .extern SYSKEYINV        /* 0xBF803B3C */
  .extern WDTCON           /* 0xBF803E80 */
  .extern WDTCONCLR        /* 0xBF803E84 */
  .extern WDTCONSET        /* 0xBF803E88 */
  .extern WDTCONINV        /* 0xBF803E8C */
  .extern T1CON            /* 0xBF808000 */
  .extern T1CONCLR         /* 0xBF808004 */
  .extern T1CONSET         /* 0xBF808008 */
  .extern T1CONINV         /* 0xBF80800C */
  .extern TMR1             /* 0xBF808010 */
  .extern TMR1CLR          /* 0xBF808014 */
  .extern TMR1SET          /* 0xBF808018 */
  .extern TMR1INV          /* 0xBF80801C */
  .extern PR1              /* 0xBF808020 */
  .extern PR1CLR           /* 0xBF808024 */
  .extern PR1SET           /* 0xBF808028 */
  .extern PR1INV           /* 0xBF80802C */
  .extern SPI1CON          /* 0xBF808080 */
  .extern SPI1CONCLR       /* 0xBF808084 */
  .extern SPI1CONSET       /* 0xBF808088 */
  .extern SPI1CONINV       /* 0xBF80808C */
  .extern SPI1STAT         /* 0xBF808090 */
  .extern SPI1STATCLR      /* 0xBF808094 */
  .extern SPI1STATSET      /* 0xBF808098 */
  .extern SPI1STATINV      /* 0xBF80809C */
  .extern SPI1BUF          /* 0xBF8080A0 */
  .extern SPI1BRG          /* 0xBF8080B0 */
  .extern SPI1BRGCLR       /* 0xBF8080B4 */
  .extern SPI1BRGSET       /* 0xBF8080B8 */
  .extern SPI1BRGINV       /* 0xBF8080BC */
  .extern SPI1CON2         /* 0xBF8080C0 */
  .extern SPI1CON2CLR      /* 0xBF8080C4 */
  .extern SPI1CON2SET      /* 0xBF8080C8 */
  .extern SPI1CON2INV      /* 0xBF8080CC */
  .extern SPI2CON          /* 0xBF808100 */
  .extern SPI2CONCLR       /* 0xBF808104 */
  .extern SPI2CONSET       /* 0xBF808108 */
  .extern SPI2CONINV       /* 0xBF80810C */
  .extern SPI2STAT         /* 0xBF808110 */
  .extern SPI2STATCLR      /* 0xBF808114 */
  .extern SPI2STATSET      /* 0xBF808118 */
  .extern SPI2STATINV      /* 0xBF80811C */
  .extern SPI2BUF          /* 0xBF808120 */
  .extern SPI2BRG          /* 0xBF808130 */
  .extern SPI2BRGCLR       /* 0xBF808134 */
  .extern SPI2BRGSET       /* 0xBF808138 */
  .extern SPI2BRGINV       /* 0xBF80813C */
  .extern SPI2CON2         /* 0xBF808140 */
  .extern SPI2CON2CLR      /* 0xBF808144 */
  .extern SPI2CON2SET      /* 0xBF808148 */
  .extern SPI2CON2INV      /* 0xBF80814C */
  .extern INTCON           /* 0xBF80F000 */
  .extern INTCONCLR        /* 0xBF80F004 */
  .extern INTCONSET        /* 0xBF80F008 */
  .extern INTCONINV        /* 0xBF80F00C */
  .extern PRISS            /* 0xBF80F010 */
  .extern PRISSCLR         /* 0xBF80F014 */
  .extern PRISSSET         /* 0xBF80F018 */
  .extern PRISSINV         /* 0xBF80F01C */
  .extern INTSTAT          /* 0xBF80F020 */
  .extern INTSTATCLR       /* 0xBF80F024 */
  .extern INTSTATSET       /* 0xBF80F028 */
  .extern INTSTATINV       /* 0xBF80F02C */
  .extern IPTMR            /* 0xBF80F030 */
  .extern IPTMRCLR         /* 0xBF80F034 */
  .extern IPTMRSET         /* 0xBF80F038 */
  .extern IPTMRINV         /* 0xBF80F03C */
  .extern IFS0             /* 0xBF80F040 */
  .extern IFS0CLR          /* 0xBF80F044 */
  .extern IFS0SET          /* 0xBF80F048 */
  .extern IFS0INV          /* 0xBF80F04C */
  .extern IFS1             /* 0xBF80F050 */
  .extern IFS1CLR          /* 0xBF80F054 */
  .extern IFS1SET          /* 0xBF80F058 */
  .extern IFS1INV          /* 0xBF80F05C */
  .extern IEC0             /* 0xBF80F0C0 */
  .extern IEC0CLR          /* 0xBF80F0C4 */
  .extern IEC0SET          /* 0xBF80F0C8 */
  .extern IEC0INV          /* 0xBF80F0CC */
  .extern IEC1             /* 0xBF80F0D0 */
  .extern IEC1CLR          /* 0xBF80F0D4 */
  .extern IEC1SET          /* 0xBF80F0D8 */
  .extern IEC1INV          /* 0xBF80F0DC */
  .extern IPC0             /* 0xBF80F140 */
  .extern IPC0CLR          /* 0xBF80F144 */
  .extern IPC0SET          /* 0xBF80F148 */
  .extern IPC0INV          /* 0xBF80F14C */
  .extern IPC1             /* 0xBF80F150 */
  .extern IPC1CLR          /* 0xBF80F154 */
  .extern IPC1SET          /* 0xBF80F158 */
  .extern IPC1INV          /* 0xBF80F15C */
  .extern IPC2             /* 0xBF80F160 */
  .extern IPC2CLR          /* 0xBF80F164 */
  .extern IPC2SET          /* 0xBF80F168 */
  .extern IPC2INV          /* 0xBF80F16C */
  .extern IPC3             /* 0xBF80F170 */
  .extern IPC3CLR          /* 0xBF80F174 */
  .extern IPC3SET          /* 0xBF80F178 */
  .extern IPC3INV          /* 0xBF80F17C */
  .extern IPC4             /* 0xBF80F180 */
  .extern IPC4CLR          /* 0xBF80F184 */
  .extern IPC4SET          /* 0xBF80F188 */
  .extern IPC4INV          /* 0xBF80F18C */
  .extern IPC5             /* 0xBF80F190 */
  .extern IPC5CLR          /* 0xBF80F194 */
  .extern IPC5SET          /* 0xBF80F198 */
  .extern IPC5INV          /* 0xBF80F19C */
  .extern IPC6             /* 0xBF80F1A0 */
  .extern IPC6CLR          /* 0xBF80F1A4 */
  .extern IPC6SET          /* 0xBF80F1A8 */
  .extern IPC6INV          /* 0xBF80F1AC */
  .extern IPC7             /* 0xBF80F1B0 */
  .extern IPC7CLR          /* 0xBF80F1B4 */
  .extern IPC7SET          /* 0xBF80F1B8 */
  .extern IPC7INV          /* 0xBF80F1BC */
  .extern IPC8             /* 0xBF80F1C0 */
  .extern IPC8CLR          /* 0xBF80F1C4 */
  .extern IPC8SET          /* 0xBF80F1C8 */
  .extern IPC8INV          /* 0xBF80F1CC */
  .extern IPC9             /* 0xBF80F1D0 */
  .extern IPC9CLR          /* 0xBF80F1D4 */
  .extern IPC9SET          /* 0xBF80F1D8 */
  .extern IPC9INV          /* 0xBF80F1DC */
  .extern IPC10            /* 0xBF80F1E0 */
  .extern IPC10CLR         /* 0xBF80F1E4 */
  .extern IPC10SET         /* 0xBF80F1E8 */
  .extern IPC10INV         /* 0xBF80F1EC */
  .extern IPC11            /* 0xBF80F1F0 */
  .extern IPC11CLR         /* 0xBF80F1F4 */
  .extern IPC11SET         /* 0xBF80F1F8 */
  .extern IPC11INV         /* 0xBF80F1FC */
  .extern IPC12            /* 0xBF80F200 */
  .extern IPC12CLR         /* 0xBF80F204 */
  .extern IPC12SET         /* 0xBF80F208 */
  .extern IPC12INV         /* 0xBF80F20C */
  .extern FDEVOPT          /* 0xBFC017C4 */
  .extern FICD             /* 0xBFC017C8 */
  .extern FPOR             /* 0xBFC017CC */
  .extern FWDT             /* 0xBFC017D0 */
  .extern FOSCSEL          /* 0xBFC017D4 */
  .extern FSEC             /* 0xBFC017D8 */
#else
#error Unknown language!
#endif

#define _RTCCON1_OUTSEL_POSITION                 0x00000004
#define _RTCCON1_OUTSEL_MASK                     0x00000070
#define _RTCCON1_OUTSEL_LENGTH                   0x00000003

#define _RTCCON1_RTCOE_POSITION                  0x00000007
#define _RTCCON1_RTCOE_MASK                      0x00000080
#define _RTCCON1_RTCOE_LENGTH                    0x00000001

#define _RTCCON1_WRLOCK_POSITION                 0x0000000B
#define _RTCCON1_WRLOCK_MASK                     0x00000800
#define _RTCCON1_WRLOCK_LENGTH                   0x00000001

