codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0064gpl036.h
#define _SR0B_SR0B14_POSITION                    0x0000000E
#define _SR0B_SR0B14_MASK                        0x00004000
#define _SR0B_SR0B14_LENGTH                      0x00000001

#define _SR0B_SR0B15_POSITION                    0x0000000F
#define _SR0B_SR0B15_MASK                        0x00008000
#define _SR0B_SR0B15_LENGTH                      0x00000001

#define _SR0B_w_POSITION                         0x00000000
#define _SR0B_w_MASK                             0xFFFFFFFF
#define _SR0B_w_LENGTH                           0x00000020

#define _SR1B_SR1B0_POSITION                     0x00000000
#define _SR1B_SR1B0_MASK                         0x00000001
#define _SR1B_SR1B0_LENGTH                       0x00000001

#define _SR1B_SR1B1_POSITION                     0x00000001
#define _SR1B_SR1B1_MASK                         0x00000002
#define _SR1B_SR1B1_LENGTH                       0x00000001

#define _SR1B_SR1B2_POSITION                     0x00000002
#define _SR1B_SR1B2_MASK                         0x00000004
#define _SR1B_SR1B2_LENGTH                       0x00000001

#define _SR1B_SR1B3_POSITION                     0x00000003
#define _SR1B_SR1B3_MASK                         0x00000008
#define _SR1B_SR1B3_LENGTH                       0x00000001

#define _SR1B_SR1B4_POSITION                     0x00000004
#define _SR1B_SR1B4_MASK                         0x00000010
#define _SR1B_SR1B4_LENGTH                       0x00000001

#define _SR1B_SR1B5_POSITION                     0x00000005
#define _SR1B_SR1B5_MASK                         0x00000020
#define _SR1B_SR1B5_LENGTH                       0x00000001

#define _SR1B_SR1B6_POSITION                     0x00000006
#define _SR1B_SR1B6_MASK                         0x00000040
#define _SR1B_SR1B6_LENGTH                       0x00000001

#define _SR1B_SR1B7_POSITION                     0x00000007
#define _SR1B_SR1B7_MASK                         0x00000080
#define _SR1B_SR1B7_LENGTH                       0x00000001

#define _SR1B_SR1B8_POSITION                     0x00000008
#define _SR1B_SR1B8_MASK                         0x00000100
#define _SR1B_SR1B8_LENGTH                       0x00000001

#define _SR1B_SR1B9_POSITION                     0x00000009
#define _SR1B_SR1B9_MASK                         0x00000200
#define _SR1B_SR1B9_LENGTH                       0x00000001

#define _SR1B_SR1B10_POSITION                    0x0000000A
#define _SR1B_SR1B10_MASK                        0x00000400
#define _SR1B_SR1B10_LENGTH                      0x00000001

#define _SR1B_SR1B11_POSITION                    0x0000000B
#define _SR1B_SR1B11_MASK                        0x00000800
#define _SR1B_SR1B11_LENGTH                      0x00000001

#define _SR1B_SR1B12_POSITION                    0x0000000C
#define _SR1B_SR1B12_MASK                        0x00001000
#define _SR1B_SR1B12_LENGTH                      0x00000001

#define _SR1B_SR1B13_POSITION                    0x0000000D
#define _SR1B_SR1B13_MASK                        0x00002000
#define _SR1B_SR1B13_LENGTH                      0x00000001

#define _SR1B_SR1B14_POSITION                    0x0000000E
#define _SR1B_SR1B14_MASK                        0x00004000
#define _SR1B_SR1B14_LENGTH                      0x00000001

#define _SR1B_SR1B15_POSITION                    0x0000000F
#define _SR1B_SR1B15_MASK                        0x00008000
#define _SR1B_SR1B15_LENGTH                      0x00000001

#define _SR1B_w_POSITION                         0x00000000
#define _SR1B_w_MASK                             0xFFFFFFFF
#define _SR1B_w_LENGTH                           0x00000020

#define _ANSELC_ANSC0_POSITION                   0x00000000
#define _ANSELC_ANSC0_MASK                       0x00000001
#define _ANSELC_ANSC0_LENGTH                     0x00000001

#define _ANSELC_ANSC1_POSITION                   0x00000001
#define _ANSELC_ANSC1_MASK                       0x00000002
#define _ANSELC_ANSC1_LENGTH                     0x00000001

#define _ANSELC_w_POSITION                       0x00000000
#define _ANSELC_w_MASK                           0xFFFFFFFF
#define _ANSELC_w_LENGTH                         0x00000020

#define _TRISC_TRISC0_POSITION                   0x00000000
#define _TRISC_TRISC0_MASK                       0x00000001
#define _TRISC_TRISC0_LENGTH                     0x00000001

#define _TRISC_TRISC1_POSITION                   0x00000001
#define _TRISC_TRISC1_MASK                       0x00000002
#define _TRISC_TRISC1_LENGTH                     0x00000001

#define _TRISC_TRISC2_POSITION                   0x00000002
#define _TRISC_TRISC2_MASK                       0x00000004
#define _TRISC_TRISC2_LENGTH                     0x00000001

#define _TRISC_TRISC3_POSITION                   0x00000003
#define _TRISC_TRISC3_MASK                       0x00000008
#define _TRISC_TRISC3_LENGTH                     0x00000001

#define _TRISC_TRISC8_POSITION                   0x00000008
#define _TRISC_TRISC8_MASK                       0x00000100
#define _TRISC_TRISC8_LENGTH                     0x00000001

#define _TRISC_TRISC9_POSITION                   0x00000009
#define _TRISC_TRISC9_MASK                       0x00000200
#define _TRISC_TRISC9_LENGTH                     0x00000001

#define _TRISC_w_POSITION                        0x00000000
#define _TRISC_w_MASK                            0xFFFFFFFF
#define _TRISC_w_LENGTH                          0x00000020

#define _PORTC_RC0_POSITION                      0x00000000
#define _PORTC_RC0_MASK                          0x00000001
#define _PORTC_RC0_LENGTH                        0x00000001

#define _PORTC_RC1_POSITION                      0x00000001
#define _PORTC_RC1_MASK                          0x00000002
#define _PORTC_RC1_LENGTH                        0x00000001

#define _PORTC_RC2_POSITION                      0x00000002
#define _PORTC_RC2_MASK                          0x00000004
#define _PORTC_RC2_LENGTH                        0x00000001

#define _PORTC_RC3_POSITION                      0x00000003
#define _PORTC_RC3_MASK                          0x00000008
#define _PORTC_RC3_LENGTH                        0x00000001

#define _PORTC_RC8_POSITION                      0x00000008
#define _PORTC_RC8_MASK                          0x00000100
#define _PORTC_RC8_LENGTH                        0x00000001

#define _PORTC_RC9_POSITION                      0x00000009
#define _PORTC_RC9_MASK                          0x00000200
#define _PORTC_RC9_LENGTH                        0x00000001

#define _PORTC_w_POSITION                        0x00000000
#define _PORTC_w_MASK                            0xFFFFFFFF
#define _PORTC_w_LENGTH                          0x00000020

