codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0064gpl036.h
#define _IPC8_CCT3IS_POSITION                    0x00000010
#define _IPC8_CCT3IS_MASK                        0x00030000
#define _IPC8_CCT3IS_LENGTH                      0x00000002

#define _IPC8_CCT3IP_POSITION                    0x00000012
#define _IPC8_CCT3IP_MASK                        0x001C0000
#define _IPC8_CCT3IP_LENGTH                      0x00000003

#define _IPC8_w_POSITION                         0x00000000
#define _IPC8_w_MASK                             0xFFFFFFFF
#define _IPC8_w_LENGTH                           0x00000020

#define _IPC9_SPI2EIS_POSITION                   0x00000008
#define _IPC9_SPI2EIS_MASK                       0x00000300
#define _IPC9_SPI2EIS_LENGTH                     0x00000002

#define _IPC9_SPI2EIP_POSITION                   0x0000000A
#define _IPC9_SPI2EIP_MASK                       0x00001C00
#define _IPC9_SPI2EIP_LENGTH                     0x00000003

#define _IPC9_SPI2TXIS_POSITION                  0x00000010
#define _IPC9_SPI2TXIS_MASK                      0x00030000
#define _IPC9_SPI2TXIS_LENGTH                    0x00000002

#define _IPC9_SPI2TXIP_POSITION                  0x00000012
#define _IPC9_SPI2TXIP_MASK                      0x001C0000
#define _IPC9_SPI2TXIP_LENGTH                    0x00000003

#define _IPC9_SPI2RXIS_POSITION                  0x00000018
#define _IPC9_SPI2RXIS_MASK                      0x03000000
#define _IPC9_SPI2RXIS_LENGTH                    0x00000002

#define _IPC9_SPI2RXIP_POSITION                  0x0000001A
#define _IPC9_SPI2RXIP_MASK                      0x1C000000
#define _IPC9_SPI2RXIP_LENGTH                    0x00000003

#define _IPC9_w_POSITION                         0x00000000
#define _IPC9_w_MASK                             0xFFFFFFFF
#define _IPC9_w_LENGTH                           0x00000020

#define _IPC10_U2RXIS_POSITION                   0x00000000
#define _IPC10_U2RXIS_MASK                       0x00000003
#define _IPC10_U2RXIS_LENGTH                     0x00000002

#define _IPC10_U2RXIP_POSITION                   0x00000002
#define _IPC10_U2RXIP_MASK                       0x0000001C
#define _IPC10_U2RXIP_LENGTH                     0x00000003

#define _IPC10_U2TXIS_POSITION                   0x00000008
#define _IPC10_U2TXIS_MASK                       0x00000300
#define _IPC10_U2TXIS_LENGTH                     0x00000002

#define _IPC10_U2TXIP_POSITION                   0x0000000A
#define _IPC10_U2TXIP_MASK                       0x00001C00
#define _IPC10_U2TXIP_LENGTH                     0x00000003

#define _IPC10_U2EIS_POSITION                    0x00000010
#define _IPC10_U2EIS_MASK                        0x00030000
#define _IPC10_U2EIS_LENGTH                      0x00000002

#define _IPC10_U2EIP_POSITION                    0x00000012
#define _IPC10_U2EIP_MASK                        0x001C0000
#define _IPC10_U2EIP_LENGTH                      0x00000003

#define _IPC10_I2C2SIS_POSITION                  0x00000018
#define _IPC10_I2C2SIS_MASK                      0x03000000
#define _IPC10_I2C2SIS_LENGTH                    0x00000002

#define _IPC10_I2C2SIP_POSITION                  0x0000001A
#define _IPC10_I2C2SIP_MASK                      0x1C000000
#define _IPC10_I2C2SIP_LENGTH                    0x00000003

#define _IPC10_w_POSITION                        0x00000000
#define _IPC10_w_MASK                            0xFFFFFFFF
#define _IPC10_w_LENGTH                          0x00000020

#define _IPC11_I2C2MIS_POSITION                  0x00000000
#define _IPC11_I2C2MIS_MASK                      0x00000003
#define _IPC11_I2C2MIS_LENGTH                    0x00000002

#define _IPC11_I2C2MIP_POSITION                  0x00000002
#define _IPC11_I2C2MIP_MASK                      0x0000001C
#define _IPC11_I2C2MIP_LENGTH                    0x00000003

#define _IPC11_I2C2BCIS_POSITION                 0x00000008
#define _IPC11_I2C2BCIS_MASK                     0x00000300
#define _IPC11_I2C2BCIS_LENGTH                   0x00000002

#define _IPC11_I2C2BCIP_POSITION                 0x0000000A
#define _IPC11_I2C2BCIP_MASK                     0x00001C00
#define _IPC11_I2C2BCIP_LENGTH                   0x00000003

#define _IPC11_NVMIS_POSITION                    0x00000010
#define _IPC11_NVMIS_MASK                        0x00030000
#define _IPC11_NVMIS_LENGTH                      0x00000002

#define _IPC11_NVMIP_POSITION                    0x00000012
#define _IPC11_NVMIP_MASK                        0x001C0000
#define _IPC11_NVMIP_LENGTH                      0x00000003

#define _IPC11_CPCIS_POSITION                    0x00000018
#define _IPC11_CPCIS_MASK                        0x03000000
#define _IPC11_CPCIS_LENGTH                      0x00000002

#define _IPC11_CPCIP_POSITION                    0x0000001A
#define _IPC11_CPCIP_MASK                        0x1C000000
#define _IPC11_CPCIP_LENGTH                      0x00000003

#define _IPC11_w_POSITION                        0x00000000
#define _IPC11_w_MASK                            0xFFFFFFFF
#define _IPC11_w_LENGTH                          0x00000020

#define _IPC12_ECCSBEIS_POSITION                 0x00000008
#define _IPC12_ECCSBEIS_MASK                     0x00000300
#define _IPC12_ECCSBEIS_LENGTH                   0x00000002

#define _IPC12_ECCSBEIP_POSITION                 0x0000000A
#define _IPC12_ECCSBEIP_MASK                     0x00001C00
#define _IPC12_ECCSBEIP_LENGTH                   0x00000003

#define _FDEVOPT_ALTCMP_POSITION                 0x00000001
#define _FDEVOPT_ALTCMP_MASK                     0x00000002
#define _FDEVOPT_ALTCMP_LENGTH                   0x00000001

#define _FDEVOPT_SOSCHP_POSITION                 0x00000003
#define _FDEVOPT_SOSCHP_MASK                     0x00000008
#define _FDEVOPT_SOSCHP_LENGTH                   0x00000001

#define _FDEVOPT_ALTI2C_POSITION                 0x00000004
#define _FDEVOPT_ALTI2C_MASK                     0x00000010
#define _FDEVOPT_ALTI2C_LENGTH                   0x00000001

#define _FDEVOPT_USERID_POSITION                 0x0000000F
#define _FDEVOPT_USERID_MASK                     0xFFFF8000
#define _FDEVOPT_USERID_LENGTH                   0x00000011

#define _FDEVOPT_w_POSITION                      0x00000000
#define _FDEVOPT_w_MASK                          0xFFFFFFFF
#define _FDEVOPT_w_LENGTH                        0x00000020

#define _FICD_JTAGEN_POSITION                    0x00000002
#define _FICD_JTAGEN_MASK                        0x00000004
#define _FICD_JTAGEN_LENGTH                      0x00000001

#define _FICD_ICS_POSITION                       0x00000003
#define _FICD_ICS_MASK                           0x00000018
#define _FICD_ICS_LENGTH                         0x00000002

#define _FICD_w_POSITION                         0x00000000
#define _FICD_w_MASK                             0xFFFFFFFF
#define _FICD_w_LENGTH                           0x00000020

#define _FPOR_BOREN_POSITION                     0x00000000
#define _FPOR_BOREN_MASK                         0x00000003
#define _FPOR_BOREN_LENGTH                       0x00000002

#define _FPOR_RETVR_POSITION                     0x00000002
#define _FPOR_RETVR_MASK                         0x00000004
#define _FPOR_RETVR_LENGTH                       0x00000001

#define _FPOR_LPBOREN_POSITION                   0x00000003
#define _FPOR_LPBOREN_MASK                       0x00000008
#define _FPOR_LPBOREN_LENGTH                     0x00000001

#define _FPOR_w_POSITION                         0x00000000
#define _FPOR_w_MASK                             0xFFFFFFFF
#define _FPOR_w_LENGTH                           0x00000020

#define _FWDT_SWDTPS_POSITION                    0x00000000
#define _FWDT_SWDTPS_MASK                        0x0000001F
#define _FWDT_SWDTPS_LENGTH                      0x00000005

#define _FWDT_FWDTWINSZ_POSITION                 0x00000005
#define _FWDT_FWDTWINSZ_MASK                     0x00000060
#define _FWDT_FWDTWINSZ_LENGTH                   0x00000002

#define _FWDT_WINDIS_POSITION                    0x00000007
#define _FWDT_WINDIS_MASK                        0x00000080
#define _FWDT_WINDIS_LENGTH                      0x00000001

